#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
terraform
Acquiring state lock. This may take a few moments...
openstack_networking_secgroup_v2.motley: Refreshing state... [id=ffb3b5f9-2b51-433d-b011-89c52f68a440]
openstack_compute_instance_v2.cloud-info: Refreshing state... [id=9b7a62e0-31b5-471b-8e36-4013216e929f]
openstack_networking_secgroup_rule_v2.motley-8080: Refreshing state... [id=091be485-0b51-482b-b00b-3aaad392aabb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # openstack_compute_instance_v2.cloud-info must be replaced
-/+ resource "openstack_compute_instance_v2" "cloud-info" {
      ~ access_ip_v4        = "192.168.1.252" -> (known after apply)
      + access_ip_v6        = (known after apply)
      ~ all_metadata        = {} -> (known after apply)
      ~ all_tags            = [] -> (known after apply)
      ~ availability_zone   = "nova" -> (known after apply)
      ~ created             = "2025-10-08 14:41:50 +0000 UTC" -> (known after apply)
      ~ flavor_name         = "svc.s" -> (known after apply)
      ~ id                  = "9b7a62e0-31b5-471b-8e36-4013216e929f" -> (known after apply)
      ~ image_id            = "f6f7391c-6ac2-42c2-88a7-ad027ad8b6c3" -> "17713d5b-3a41-4c40-b44d-32c74ed6dab1"
      ~ image_name          = "ubuntu-24.04-x86_64-raw" -> (known after apply)
        name                = "cloud-info"
      + region              = (known after apply)
      - tags                = [] -> null
      ~ updated             = "2025-10-08 14:41:59 +0000 UTC" -> (known after apply)
      ~ user_data           = "84aadcf06e75d367d10fe966cb0d2bf70570a9a9" -> "9e0ed93d524fe3b67887f46af5a1212887f9e2c6" # forces replacement
        # (5 unchanged attributes hidden)

      ~ network {
          ~ fixed_ip_v4    = "192.168.1.252" -> (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          ~ mac            = "fa:16:3e:8f:26:66" -> (known after apply)
          ~ name           = "cloud_egi_net" -> (known after apply)
          + port           = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ instance-id = "9b7a62e0-31b5-471b-8e36-4013216e929f" -> (known after apply)

Warning: Argument is deprecated

  with provider["registry.terraform.io/terraform-provider-openstack/openstack"],
  on backend.tf line 10, in provider "openstack":
  10: provider "openstack" {

Users not using loadbalancer resources can ignore this message. Support for
neutron-lbaas will be removed on next major release. Octavia will be the only
supported method for loadbalancer resources. Users using octavia will have to
remove 'use_octavia' option from the provider configuration block. Users
using neutron-lbaas will have to migrate/upgrade to octavia.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @enolfc, Action: `pull_request`*